openocd-org/openocd/contrib/loaders/flash/max32xxx/gcr_regs.h
/* SPDX-License-Identifier: GPL-2.0-or-later */

/***************************************************************************
 *   Copyright (C) 2016 by Maxim Integrated                                *
 *   Copyright (C) 2025 Analog Devices, Inc.                               *
 ***************************************************************************/

#ifndef _GCR_REGS_H_
#define _GCR_REGS_H_

/* **** Includes **** */
#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__ICCARM__)
#pragma system_include
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#endif
/*/ @cond */
/*
	If types are not defined elsewhere (CMSIS) define them here
*/
#ifndef __IO
#define __IO volatile
#endif
#ifndef __I
#define __I volatile const
#endif
#ifndef __O
#define __O volatile
#endif
#ifndef __R
#define __R volatile const
#endif
/*/ @endcond */

/* **** Definitions **** */

/**
 * @ingroup     gcr
 * @defgroup    gcr_registers GCR_Registers
 * @brief       Registers, Bit Masks and Bit Positions for the GCR Peripheral Module.
 * @details Global Control Registers.
 */

/**
 * @ingroup gcr_registers
 * Structure type to access the GCR Registers.
 */
struct mxc_gcr_regs {
	__IO uint32_t scon;	 /**< <tt>\b 0x00:</tt> GCR SCON Register */
	__IO uint32_t rstr0; /**< <tt>\b 0x04:</tt> GCR RSTR0 Register */
	__IO uint32_t clkcn; /**< <tt>\b 0x08:</tt> GCR CLKCN Register */
	__IO uint32_t pm;	 /**< <tt>\b 0x0C:</tt> GCR PM Register */
	__R uint32_t rsv_0x10_0x17[2];
	__IO uint32_t pckdiv; /**< <tt>\b 0x18:</tt> GCR PCKDIV Register */
	__R uint32_t rsv_0x1c_0x23[2];
	__IO uint32_t perckcn0; /**< <tt>\b 0x24:</tt> GCR PERCKCN0 Register */
	__IO uint32_t memckcn;	/**< <tt>\b 0x28:</tt> GCR MEMCKCN Register */
	__IO uint32_t memzcn;	/**< <tt>\b 0x2C:</tt> GCR MEMZCN Register */
	__R uint32_t rsv_0x30_0x3f[4];
	__IO uint32_t sysst;	/**< <tt>\b 0x40:</tt> GCR SYSST Register */
	__IO uint32_t rstr1;	/**< <tt>\b 0x44:</tt> GCR RSTR1 Register */
	__IO uint32_t perckcn1; /**< <tt>\b 0x48:</tt> GCR PERCKCN1 Register */
	__IO uint32_t evten;	/**< <tt>\b 0x4C:</tt> GCR EVTEN Register */
	__I uint32_t revision;	/**< <tt>\b 0x50:</tt> GCR REVISION Register */
	__IO uint32_t syssie;	/**< <tt>\b 0x54:</tt> GCR SYSSIE Register */
	__R uint32_t rsv_0x58_0x63[3];
	__IO uint32_t eccerr;	/**< <tt>\b 0x64:</tt> GCR ECCERR Register */
	__IO uint32_t eccnded;	/**< <tt>\b 0x68:</tt> GCR ECCNDED Register */
	__IO uint32_t eccirqen; /**< <tt>\b 0x6C:</tt> GCR ECCIRQEN Register */
	__IO uint32_t eccerrad; /**< <tt>\b 0x70:</tt> GCR ECCERRAD Register */
};

/* Register offsets for module GCR */
/**
 * @ingroup    gcr_registers
 * @defgroup   GCR_Register_Offsets Register Offsets
 * @brief      GCR Peripheral Register Offsets from the GCR Base Peripheral Address.
 * @{
 */
#define MXC_R_GCR_SCON ((uint32_t)0x00000000UL)		/**< Offset from GCR Base Address: 0x0000 */
#define MXC_R_GCR_RSTR0 ((uint32_t)0x00000004UL)	/**< Offset from GCR Base Address: 0x0004 */
#define MXC_R_GCR_CLKCN ((uint32_t)0x00000008UL)	/**< Offset from GCR Base Address: 0x0008 */
#define MXC_R_GCR_PM ((uint32_t)0x0000000CUL)		/**< Offset from GCR Base Address: 0x000C */
#define MXC_R_GCR_PCKDIV ((uint32_t)0x00000018UL)	/**< Offset from GCR Base Address: 0x0018 */
#define MXC_R_GCR_PERCKCN0 ((uint32_t)0x00000024UL) /**< Offset from GCR Base Address: 0x0024 */
#define MXC_R_GCR_MEMCKCN ((uint32_t)0x00000028UL)	/**< Offset from GCR Base Address: 0x0028 */
#define MXC_R_GCR_MEMZCN ((uint32_t)0x0000002CUL)	/**< Offset from GCR Base Address: 0x002C */
#define MXC_R_GCR_SYSST ((uint32_t)0x00000040UL)	/**< Offset from GCR Base Address: 0x0040 */
#define MXC_R_GCR_RSTR1 ((uint32_t)0x00000044UL)	/**< Offset from GCR Base Address: 0x0044 */
#define MXC_R_GCR_PERCKCN1 ((uint32_t)0x00000048UL) /**< Offset from GCR Base Address: 0x0048 */
#define MXC_R_GCR_EVTEN ((uint32_t)0x0000004CUL)	/**< Offset from GCR Base Address: 0x004C */
#define MXC_R_GCR_REVISION ((uint32_t)0x00000050UL) /**< Offset from GCR Base Address: 0x0050 */
#define MXC_R_GCR_SYSSIE ((uint32_t)0x00000054UL)	/**< Offset from GCR Base Address: 0x0054 */
#define MXC_R_GCR_ECCERR ((uint32_t)0x00000064UL)	/**< Offset from GCR Base Address: 0x0064 */
#define MXC_R_GCR_ECCNDED ((uint32_t)0x00000068UL)	/**< Offset from GCR Base Address: 0x0068 */
#define MXC_R_GCR_ECCIRQEN ((uint32_t)0x0000006CUL) /**< Offset from GCR Base Address: 0x006C */
#define MXC_R_GCR_ECCERRAD ((uint32_t)0x00000070UL) /**< Offset from GCR Base Address: 0x0070 */
													/**@} end of group gcr_registers */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_SCON GCR_SCON
 * @brief    System Control.
 * @{
 */
#define MXC_F_GCR_SCON_BSTAPEN_POS 0											 /**< SCON_BSTAPEN Position */
#define MXC_F_GCR_SCON_BSTAPEN ((uint32_t)(0x1UL << MXC_F_GCR_SCON_BSTAPEN_POS)) /**< SCON_BSTAPEN Mask */
#define MXC_V_GCR_SCON_BSTAPEN_DIS ((uint32_t)0x0UL)							 /**< SCON_BSTAPEN_DIS Value */
#define MXC_S_GCR_SCON_BSTAPEN_DIS                                                                                     \
	(MXC_V_GCR_SCON_BSTAPEN_DIS << MXC_F_GCR_SCON_BSTAPEN_POS) /**< SCON_BSTAPEN_DIS Setting */
#define MXC_V_GCR_SCON_BSTAPEN_EN ((uint32_t)0x1UL)			   /**< SCON_BSTAPEN_EN Value */
#define MXC_S_GCR_SCON_BSTAPEN_EN                                                                                      \
	(MXC_V_GCR_SCON_BSTAPEN_EN << MXC_F_GCR_SCON_BSTAPEN_POS) /**< SCON_BSTAPEN_EN Setting */

#define MXC_F_GCR_SCON_SBUSARB_POS 1											 /**< SCON_SBUSARB Position */
#define MXC_F_GCR_SCON_SBUSARB ((uint32_t)(0x3UL << MXC_F_GCR_SCON_SBUSARB_POS)) /**< SCON_SBUSARB Mask */
#define MXC_V_GCR_SCON_SBUSARB_FIX ((uint32_t)0x0UL)							 /**< SCON_SBUSARB_FIX Value */
#define MXC_S_GCR_SCON_SBUSARB_FIX                                                                                     \
	(MXC_V_GCR_SCON_SBUSARB_FIX << MXC_F_GCR_SCON_SBUSARB_POS) /**< SCON_SBUSARB_FIX Setting */
#define MXC_V_GCR_SCON_SBUSARB_ROUND ((uint32_t)0x1UL)		   /**< SCON_SBUSARB_ROUND Value */
#define MXC_S_GCR_SCON_SBUSARB_ROUND                                                                                   \
	(MXC_V_GCR_SCON_SBUSARB_ROUND << MXC_F_GCR_SCON_SBUSARB_POS) /**< SCON_SBUSARB_ROUND Setting */

#define MXC_F_GCR_SCON_FLASH_PAGE_FLIP_POS 4 /**< SCON_FLASH_PAGE_FLIP Position */
#define MXC_F_GCR_SCON_FLASH_PAGE_FLIP                                                                                 \
	((uint32_t)(0x1UL << MXC_F_GCR_SCON_FLASH_PAGE_FLIP_POS))	/**< SCON_FLASH_PAGE_FLIP Mask */
#define MXC_V_GCR_SCON_FLASH_PAGE_FLIP_NORMAL ((uint32_t)0x0UL) /**< SCON_FLASH_PAGE_FLIP_NORMAL Value */
#define MXC_S_GCR_SCON_FLASH_PAGE_FLIP_NORMAL                                                                          \
	(MXC_V_GCR_SCON_FLASH_PAGE_FLIP_NORMAL                                                                             \
	 << MXC_F_GCR_SCON_FLASH_PAGE_FLIP_POS)						 /**< SCON_FLASH_PAGE_FLIP_NORMAL Setting */
#define MXC_V_GCR_SCON_FLASH_PAGE_FLIP_SWAPPED ((uint32_t)0x1UL) /**< SCON_FLASH_PAGE_FLIP_SWAPPED Value */
#define MXC_S_GCR_SCON_FLASH_PAGE_FLIP_SWAPPED                                                                         \
	(MXC_V_GCR_SCON_FLASH_PAGE_FLIP_SWAPPED                                                                            \
	 << MXC_F_GCR_SCON_FLASH_PAGE_FLIP_POS) /**< SCON_FLASH_PAGE_FLIP_SWAPPED Setting */

#define MXC_F_GCR_SCON_CCACHE_FLUSH_POS 6 /**< SCON_CCACHE_FLUSH Position */
#define MXC_F_GCR_SCON_CCACHE_FLUSH                                                                                    \
	((uint32_t)(0x1UL << MXC_F_GCR_SCON_CCACHE_FLUSH_POS))	 /**< SCON_CCACHE_FLUSH Mask */
#define MXC_V_GCR_SCON_CCACHE_FLUSH_NORMAL ((uint32_t)0x0UL) /**< SCON_CCACHE_FLUSH_NORMAL Value */
#define MXC_S_GCR_SCON_CCACHE_FLUSH_NORMAL                                                                             \
	(MXC_V_GCR_SCON_CCACHE_FLUSH_NORMAL << MXC_F_GCR_SCON_CCACHE_FLUSH_POS) /**< SCON_CCACHE_FLUSH_NORMAL Setting */
#define MXC_V_GCR_SCON_CCACHE_FLUSH_FLUSH ((uint32_t)0x1UL)					/**< SCON_CCACHE_FLUSH_FLUSH Value */
#define MXC_S_GCR_SCON_CCACHE_FLUSH_FLUSH                                                                              \
	(MXC_V_GCR_SCON_CCACHE_FLUSH_FLUSH << MXC_F_GCR_SCON_CCACHE_FLUSH_POS) /**< SCON_CCACHE_FLUSH_FLUSH Setting */

#define MXC_F_GCR_SCON_CCHK_POS 13										   /**< SCON_CCHK Position */
#define MXC_F_GCR_SCON_CCHK ((uint32_t)(0x1UL << MXC_F_GCR_SCON_CCHK_POS)) /**< SCON_CCHK Mask */
#define MXC_V_GCR_SCON_CCHK_COMPLETE ((uint32_t)0x0UL)					   /**< SCON_CCHK_COMPLETE Value */
#define MXC_S_GCR_SCON_CCHK_COMPLETE                                                                                   \
	(MXC_V_GCR_SCON_CCHK_COMPLETE << MXC_F_GCR_SCON_CCHK_POS) /**< SCON_CCHK_COMPLETE Setting */
#define MXC_V_GCR_SCON_CCHK_START ((uint32_t)0x1UL)			  /**< SCON_CCHK_START Value */
#define MXC_S_GCR_SCON_CCHK_START (MXC_V_GCR_SCON_CCHK_START << MXC_F_GCR_SCON_CCHK_POS) /**< SCON_CCHK_START Setting  \
																						  */

#define MXC_F_GCR_SCON_CHKRES_POS 15										   /**< SCON_CHKRES Position */
#define MXC_F_GCR_SCON_CHKRES ((uint32_t)(0x1UL << MXC_F_GCR_SCON_CHKRES_POS)) /**< SCON_CHKRES Mask */
#define MXC_V_GCR_SCON_CHKRES_PASS ((uint32_t)0x0UL)						   /**< SCON_CHKRES_PASS Value */
#define MXC_S_GCR_SCON_CHKRES_PASS                                                                                     \
	(MXC_V_GCR_SCON_CHKRES_PASS << MXC_F_GCR_SCON_CHKRES_POS) /**< SCON_CHKRES_PASS Setting */
#define MXC_V_GCR_SCON_CHKRES_FAIL ((uint32_t)0x1UL)		  /**< SCON_CHKRES_FAIL Value */
#define MXC_S_GCR_SCON_CHKRES_FAIL                                                                                     \
	(MXC_V_GCR_SCON_CHKRES_FAIL << MXC_F_GCR_SCON_CHKRES_POS) /**< SCON_CHKRES_FAIL Setting */

#define MXC_F_GCR_SCON_OVR_POS 16													/**< SCON_OVR Position */
#define MXC_F_GCR_SCON_OVR ((uint32_t)(0x3UL << MXC_F_GCR_SCON_OVR_POS))			/**< SCON_OVR Mask */
#define MXC_V_GCR_SCON_OVR_0_9V ((uint32_t)0x0UL)									/**< SCON_OVR_0_9V Value */
#define MXC_S_GCR_SCON_OVR_0_9V (MXC_V_GCR_SCON_OVR_0_9V << MXC_F_GCR_SCON_OVR_POS) /**< SCON_OVR_0_9V Setting */
#define MXC_V_GCR_SCON_OVR_1_0V ((uint32_t)0x1UL)									/**< SCON_OVR_1_0V Value */
#define MXC_S_GCR_SCON_OVR_1_0V (MXC_V_GCR_SCON_OVR_1_0V << MXC_F_GCR_SCON_OVR_POS) /**< SCON_OVR_1_0V Setting */
#define MXC_V_GCR_SCON_OVR_1_1V ((uint32_t)0x2UL)									/**< SCON_OVR_1_1V Value */
#define MXC_S_GCR_SCON_OVR_1_1V (MXC_V_GCR_SCON_OVR_1_1V << MXC_F_GCR_SCON_OVR_POS) /**< SCON_OVR_1_1V Setting */

#define MXC_F_GCR_SCON_MEMPROT_EN_POS 20											   /**< SCON_MEMPROT_EN Position */
#define MXC_F_GCR_SCON_MEMPROT_EN ((uint32_t)(0x1UL << MXC_F_GCR_SCON_MEMPROT_EN_POS)) /**< SCON_MEMPROT_EN Mask */
#define MXC_V_GCR_SCON_MEMPROT_EN_DIS ((uint32_t)0x0UL)								   /**< SCON_MEMPROT_EN_DIS Value */
#define MXC_S_GCR_SCON_MEMPROT_EN_DIS                                                                                  \
	(MXC_V_GCR_SCON_MEMPROT_EN_DIS << MXC_F_GCR_SCON_MEMPROT_EN_POS) /**< SCON_MEMPROT_EN_DIS Setting */
#define MXC_V_GCR_SCON_MEMPROT_EN_EN ((uint32_t)0x1UL)				 /**< SCON_MEMPROT_EN_EN Value */
#define MXC_S_GCR_SCON_MEMPROT_EN_EN                                                                                   \
	(MXC_V_GCR_SCON_MEMPROT_EN_EN << MXC_F_GCR_SCON_MEMPROT_EN_POS) /**< SCON_MEMPROT_EN_EN Setting */

